shihyu/STM32F4/lm3s811/stellaris/driverlib/pin_map.h
#define C0O_PERIPH              (SYSCTL_PERIPH_GPIOB)
#define C0O_PORT                (GPIO_PORTB_BASE)
#define C0O_PIN                 (GPIO_PIN_5)

#define C0_MINUS_PERIPH         (SYSCTL_PERIPH_GPIOB)
#define C0_MINUS_PORT           (GPIO_PORTB_BASE)
#define C0_MINUS_PIN            (GPIO_PIN_4)

#define C0_PLUS_PERIPH          (SYSCTL_PERIPH_GPIOB)
#define C0_PLUS_PORT            (GPIO_PORTB_BASE)
#define C0_PLUS_PIN             (GPIO_PIN_6)

#define CCP0_PERIPH             (SYSCTL_PERIPH_GPIOD)
#define CCP0_PORT               (GPIO_PORTD_BASE)
#define CCP0_PIN                (GPIO_PIN_4)

#define CCP1_PERIPH             (SYSCTL_PERIPH_GPIOC)
#define CCP1_PORT               (GPIO_PORTC_BASE)
#define CCP1_PIN                (GPIO_PIN_5)

#define CCP2_PERIPH             (SYSCTL_PERIPH_GPIOD)
#define CCP2_PORT               (GPIO_PORTD_BASE)
#define CCP2_PIN                (GPIO_PIN_5)

#define CCP4_PERIPH             (SYSCTL_PERIPH_GPIOC)
#define CCP4_PORT               (GPIO_PORTC_BASE)
#define CCP4_PIN                (GPIO_PIN_7)

#define FAULT_PERIPH            (SYSCTL_PERIPH_GPIOB)
#define FAULT_PORT              (GPIO_PORTB_BASE)
#define FAULT_PIN               (GPIO_PIN_3)

#define IDX_PERIPH              (SYSCTL_PERIPH_GPIOB)
#define IDX_PORT                (GPIO_PORTB_BASE)
#define IDX_PIN                 (GPIO_PIN_2)

#define PHA_PERIPH              (SYSCTL_PERIPH_GPIOC)
#define PHA_PORT                (GPIO_PORTC_BASE)
#define PHA_PIN                 (GPIO_PIN_4)

#define PHB_PERIPH              (SYSCTL_PERIPH_GPIOC)
#define PHB_PORT                (GPIO_PORTC_BASE)
#define PHB_PIN                 (GPIO_PIN_6)

#define PWM0_PERIPH             (SYSCTL_PERIPH_GPIOD)
#define PWM0_PORT               (GPIO_PORTD_BASE)
#define PWM0_PIN                (GPIO_PIN_0)

#define PWM1_PERIPH             (SYSCTL_PERIPH_GPIOD)
#define PWM1_PORT               (GPIO_PORTD_BASE)
#define PWM1_PIN                (GPIO_PIN_1)

#define PWM2_PERIPH             (SYSCTL_PERIPH_GPIOB)
#define PWM2_PORT               (GPIO_PORTB_BASE)
#define PWM2_PIN                (GPIO_PIN_0)

#define PWM3_PERIPH             (SYSCTL_PERIPH_GPIOB)
#define PWM3_PORT               (GPIO_PORTB_BASE)
#define PWM3_PIN                (GPIO_PIN_1)

#define PWM4_PERIPH             (SYSCTL_PERIPH_GPIOE)
#define PWM4_PORT               (GPIO_PORTE_BASE)
#define PWM4_PIN                (GPIO_PIN_0)

#define PWM5_PERIPH             (SYSCTL_PERIPH_GPIOE)
#define PWM5_PORT               (GPIO_PORTE_BASE)
#define PWM5_PIN                (GPIO_PIN_1)

#define SSICLK_PERIPH           (SYSCTL_PERIPH_GPIOA)
#define SSICLK_PORT             (GPIO_PORTA_BASE)
#define SSICLK_PIN              (GPIO_PIN_2)

#define SSIFSS_PERIPH           (SYSCTL_PERIPH_GPIOA)
#define SSIFSS_PORT             (GPIO_PORTA_BASE)
#define SSIFSS_PIN              (GPIO_PIN_3)

#define SSIRX_PERIPH            (SYSCTL_PERIPH_GPIOA)
#define SSIRX_PORT              (GPIO_PORTA_BASE)
#define SSIRX_PIN               (GPIO_PIN_4)

#define SSITX_PERIPH            (SYSCTL_PERIPH_GPIOA)
#define SSITX_PORT              (GPIO_PORTA_BASE)
#define SSITX_PIN               (GPIO_PIN_5)

#define SWCLK_PERIPH            (SYSCTL_PERIPH_GPIOC)
#define SWCLK_PORT              (GPIO_PORTC_BASE)
#define SWCLK_PIN               (GPIO_PIN_0)

#define SWDIO_PERIPH            (SYSCTL_PERIPH_GPIOC)
#define SWDIO_PORT              (GPIO_PORTC_BASE)
#define SWDIO_PIN               (GPIO_PIN_1)

#define SWO_PERIPH              (SYSCTL_PERIPH_GPIOC)
#define SWO_PORT                (GPIO_PORTC_BASE)
#define SWO_PIN                 (GPIO_PIN_3)

#define TCK_PERIPH              (SYSCTL_PERIPH_GPIOC)
#define TCK_PORT                (GPIO_PORTC_BASE)
#define TCK_PIN                 (GPIO_PIN_0)

#define TDI_PERIPH              (SYSCTL_PERIPH_GPIOC)
#define TDI_PORT                (GPIO_PORTC_BASE)
#define TDI_PIN                 (GPIO_PIN_2)

#define TDO_PERIPH              (SYSCTL_PERIPH_GPIOC)
#define TDO_PORT                (GPIO_PORTC_BASE)
#define TDO_PIN                 (GPIO_PIN_3)

#define TMS_PERIPH              (SYSCTL_PERIPH_GPIOC)
#define TMS_PORT                (GPIO_PORTC_BASE)
#define TMS_PIN                 (GPIO_PIN_1)

#define TRST_PERIPH             (SYSCTL_PERIPH_GPIOB)
#define TRST_PORT               (GPIO_PORTB_BASE)
#define TRST_PIN                (GPIO_PIN_7)

#define U0RX_PERIPH             (SYSCTL_PERIPH_GPIOA)
#define U0RX_PORT               (GPIO_PORTA_BASE)
#define U0RX_PIN                (GPIO_PIN_0)

#define U0TX_PERIPH             (SYSCTL_PERIPH_GPIOA)
#define U0TX_PORT               (GPIO_PORTA_BASE)
#define U0TX_PIN                (GPIO_PIN_1)

#define U1RX_PERIPH             (SYSCTL_PERIPH_GPIOD)
#define U1RX_PORT               (GPIO_PORTD_BASE)
#define U1RX_PIN                (GPIO_PIN_2)

#define U1TX_PERIPH             (SYSCTL_PERIPH_GPIOD)
#define U1TX_PORT               (GPIO_PORTD_BASE)
#define U1TX_PIN                (GPIO_PIN_3)

#endif // PART_LM3S818

//*****************************************************************************
//
// LM3S828 Port/Pin Mapping Definitions
//
//*****************************************************************************
#ifdef PART_LM3S828

#define CCP0_PERIPH             (SYSCTL_PERIPH_GPIOB)
#define CCP0_PORT               (GPIO_PORTB_BASE)
#define CCP0_PIN                (GPIO_PIN_0)

#define CCP1_PERIPH             (SYSCTL_PERIPH_GPIOC)
#define CCP1_PORT               (GPIO_PORTC_BASE)
#define CCP1_PIN                (GPIO_PIN_5)

#define CCP2_PERIPH             (SYSCTL_PERIPH_GPIOB)
#define CCP2_PORT               (GPIO_PORTB_BASE)
#define CCP2_PIN                (GPIO_PIN_1)

#define CCP3_PERIPH             (SYSCTL_PERIPH_GPIOC)
#define CCP3_PORT               (GPIO_PORTC_BASE)
#define CCP3_PIN                (GPIO_PIN_6)

#define CCP4_PERIPH             (SYSCTL_PERIPH_GPIOC)
#define CCP4_PORT               (GPIO_PORTC_BASE)
#define CCP4_PIN                (GPIO_PIN_7)

#define CCP5_PERIPH             (SYSCTL_PERIPH_GPIOB)
#define CCP5_PORT               (GPIO_PORTB_BASE)
#define CCP5_PIN                (GPIO_PIN_5)

#define I2CSCL_PERIPH           (SYSCTL_PERIPH_GPIOB)
#define I2CSCL_PORT             (GPIO_PORTB_BASE)
#define I2CSCL_PIN              (GPIO_PIN_2)

#define I2CSDA_PERIPH           (SYSCTL_PERIPH_GPIOB)
#define I2CSDA_PORT             (GPIO_PORTB_BASE)
#define I2CSDA_PIN              (GPIO_PIN_3)

#define SSICLK_PERIPH           (SYSCTL_PERIPH_GPIOA)
#define SSICLK_PORT             (GPIO_PORTA_BASE)
#define SSICLK_PIN              (GPIO_PIN_2)

#define SSIFSS_PERIPH           (SYSCTL_PERIPH_GPIOA)
#define SSIFSS_PORT             (GPIO_PORTA_BASE)
#define SSIFSS_PIN              (GPIO_PIN_3)

#define SSIRX_PERIPH            (SYSCTL_PERIPH_GPIOA)
#define SSIRX_PORT              (GPIO_PORTA_BASE)
#define SSIRX_PIN               (GPIO_PIN_4)

#define SSITX_PERIPH            (SYSCTL_PERIPH_GPIOA)
#define SSITX_PORT              (GPIO_PORTA_BASE)
#define SSITX_PIN               (GPIO_PIN_5)

#define SWCLK_PERIPH            (SYSCTL_PERIPH_GPIOC)
#define SWCLK_PORT              (GPIO_PORTC_BASE)
#define SWCLK_PIN               (GPIO_PIN_0)

#define SWDIO_PERIPH            (SYSCTL_PERIPH_GPIOC)
#define SWDIO_PORT              (GPIO_PORTC_BASE)
#define SWDIO_PIN               (GPIO_PIN_1)

