shihyu/STM32F4/lm3s811/stellaris/driverlib/pin_map.h
#define PWM3_PERIPH             (SYSCTL_PERIPH_GPIOB)
#define PWM3_PORT               (GPIO_PORTB_BASE)
#define PWM3_PIN                (GPIO_PIN_1)

#define PWM4_PERIPH             (SYSCTL_PERIPH_GPIOA)
#define PWM4_PORT               (GPIO_PORTA_BASE)
#define PWM4_PIN                (GPIO_PIN_6)

#define PWM5_PERIPH             (SYSCTL_PERIPH_GPIOA)
#define PWM5_PORT               (GPIO_PORTA_BASE)
#define PWM5_PIN                (GPIO_PIN_7)

#define PWM6_PERIPH             (SYSCTL_PERIPH_GPIOC)
#define PWM6_PORT               (GPIO_PORTC_BASE)
#define PWM6_PIN                (GPIO_PIN_4)

#define PWM7_PERIPH             (SYSCTL_PERIPH_GPIOC)
#define PWM7_PORT               (GPIO_PORTC_BASE)
#define PWM7_PIN                (GPIO_PIN_6)

#define SSI0CLK_PERIPH          (SYSCTL_PERIPH_GPIOA)
#define SSI0CLK_PORT            (GPIO_PORTA_BASE)
#define SSI0CLK_PIN             (GPIO_PIN_2)

#define SSI0FSS_PERIPH          (SYSCTL_PERIPH_GPIOA)
#define SSI0FSS_PORT            (GPIO_PORTA_BASE)
#define SSI0FSS_PIN             (GPIO_PIN_3)

#define SSI0RX_PERIPH           (SYSCTL_PERIPH_GPIOA)
#define SSI0RX_PORT             (GPIO_PORTA_BASE)
#define SSI0RX_PIN              (GPIO_PIN_4)

#define SSI0TX_PERIPH           (SYSCTL_PERIPH_GPIOA)
#define SSI0TX_PORT             (GPIO_PORTA_BASE)
#define SSI0TX_PIN              (GPIO_PIN_5)

#define SWCLK_PERIPH            (SYSCTL_PERIPH_GPIOC)
#define SWCLK_PORT              (GPIO_PORTC_BASE)
#define SWCLK_PIN               (GPIO_PIN_0)

#define SWDIO_PERIPH            (SYSCTL_PERIPH_GPIOC)
#define SWDIO_PORT              (GPIO_PORTC_BASE)
#define SWDIO_PIN               (GPIO_PIN_1)

#define SWO_PERIPH              (SYSCTL_PERIPH_GPIOC)
#define SWO_PORT                (GPIO_PORTC_BASE)
#define SWO_PIN                 (GPIO_PIN_3)

#define TCK_PERIPH              (SYSCTL_PERIPH_GPIOC)
#define TCK_PORT                (GPIO_PORTC_BASE)
#define TCK_PIN                 (GPIO_PIN_0)

#define TDI_PERIPH              (SYSCTL_PERIPH_GPIOC)
#define TDI_PORT                (GPIO_PORTC_BASE)
#define TDI_PIN                 (GPIO_PIN_2)

#define TDO_PERIPH              (SYSCTL_PERIPH_GPIOC)
#define TDO_PORT                (GPIO_PORTC_BASE)
#define TDO_PIN                 (GPIO_PIN_3)

#define TMS_PERIPH              (SYSCTL_PERIPH_GPIOC)
#define TMS_PORT                (GPIO_PORTC_BASE)
#define TMS_PIN                 (GPIO_PIN_1)

#define U0RX_PERIPH             (SYSCTL_PERIPH_GPIOA)
#define U0RX_PORT               (GPIO_PORTA_BASE)
#define U0RX_PIN                (GPIO_PIN_0)

#define U0TX_PERIPH             (SYSCTL_PERIPH_GPIOA)
#define U0TX_PORT               (GPIO_PORTA_BASE)
#define U0TX_PIN                (GPIO_PIN_1)

#endif // PART_LM3S2776

//*****************************************************************************
//
// LM3S3651 Port/Pin Mapping Definitions
//
//*****************************************************************************
#ifdef PART_LM3S3651

#define ADC0_PERIPH             (SYSCTL_PERIPH_GPIOE)
#define ADC0_PORT               (GPIO_PORTE_BASE)
#define ADC0_PIN                (GPIO_PIN_3)

#define ADC1_PERIPH             (SYSCTL_PERIPH_GPIOE)
#define ADC1_PORT               (GPIO_PORTE_BASE)
#define ADC1_PIN                (GPIO_PIN_2)

#define ADC2_PERIPH             (SYSCTL_PERIPH_GPIOE)
#define ADC2_PORT               (GPIO_PORTE_BASE)
#define ADC2_PIN                (GPIO_PIN_1)

#define ADC3_PERIPH             (SYSCTL_PERIPH_GPIOE)
#define ADC3_PORT               (GPIO_PORTE_BASE)
#define ADC3_PIN                (GPIO_PIN_0)

#define C0O_PERIPH              (SYSCTL_PERIPH_GPIOB)
#define C0O_PORT                (GPIO_PORTB_BASE)
#define C0O_PIN                 (GPIO_PIN_6)

#define C0_MINUS_PERIPH         (SYSCTL_PERIPH_GPIOB)
#define C0_MINUS_PORT           (GPIO_PORTB_BASE)
#define C0_MINUS_PIN            (GPIO_PIN_4)

#define C0_PLUS_PERIPH          (SYSCTL_PERIPH_GPIOB)
#define C0_PLUS_PORT            (GPIO_PORTB_BASE)
#define C0_PLUS_PIN             (GPIO_PIN_6)

#define C1_MINUS_PERIPH         (SYSCTL_PERIPH_GPIOB)
#define C1_MINUS_PORT           (GPIO_PORTB_BASE)
#define C1_MINUS_PIN            (GPIO_PIN_5)

#define C1_PLUS_PERIPH          (SYSCTL_PERIPH_GPIOC)
#define C1_PLUS_PORT            (GPIO_PORTC_BASE)
#define C1_PLUS_PIN             (GPIO_PIN_7)

#define CCP0_PERIPH             (SYSCTL_PERIPH_GPIOD)
#define CCP0_PORT               (GPIO_PORTD_BASE)
#define CCP0_PIN                (GPIO_PIN_3)

#define CCP1_PERIPH             (SYSCTL_PERIPH_GPIOA)
#define CCP1_PORT               (GPIO_PORTA_BASE)
#define CCP1_PIN                (GPIO_PIN_6)

#define CCP2_PERIPH             (SYSCTL_PERIPH_GPIOC)
#define CCP2_PORT               (GPIO_PORTC_BASE)
#define CCP2_PIN                (GPIO_PIN_4)

#define CCP3_PERIPH             (SYSCTL_PERIPH_GPIOE)
#define CCP3_PORT               (GPIO_PORTE_BASE)
#define CCP3_PIN                (GPIO_PIN_4)

#define CCP4_PERIPH             (SYSCTL_PERIPH_GPIOA)
#define CCP4_PORT               (GPIO_PORTA_BASE)
#define CCP4_PIN                (GPIO_PIN_7)

#define CCP5_PERIPH             (SYSCTL_PERIPH_GPIOD)
#define CCP5_PORT               (GPIO_PORTD_BASE)
#define CCP5_PIN                (GPIO_PIN_2)

#define CCP6_PERIPH             (SYSCTL_PERIPH_GPIOD)
#define CCP6_PORT               (GPIO_PORTD_BASE)
#define CCP6_PIN                (GPIO_PIN_0)

#define CCP7_PERIPH             (SYSCTL_PERIPH_GPIOD)
#define CCP7_PORT               (GPIO_PORTD_BASE)
#define CCP7_PIN                (GPIO_PIN_1)

#define I2C0SCL_PERIPH          (SYSCTL_PERIPH_GPIOB)
#define I2C0SCL_PORT            (GPIO_PORTB_BASE)
#define I2C0SCL_PIN             (GPIO_PIN_2)

#define I2C0SDA_PERIPH          (SYSCTL_PERIPH_GPIOB)
#define I2C0SDA_PORT            (GPIO_PORTB_BASE)
#define I2C0SDA_PIN             (GPIO_PIN_3)

#define NMI_PERIPH              (SYSCTL_PERIPH_GPIOB)
#define NMI_PORT                (GPIO_PORTB_BASE)
#define NMI_PIN                 (GPIO_PIN_7)

